wrk_rps_merged/266
Running 5m test @ http://10.106.248.153:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 290.997ms, rate sampling interval: 1089ms
  Thread calibration: mean lat.: 260.005ms, rate sampling interval: 1021ms
  Thread calibration: mean lat.: 299.846ms, rate sampling interval: 1092ms
  Thread calibration: mean lat.: 287.984ms, rate sampling interval: 1163ms
  Thread calibration: mean lat.: 296.769ms, rate sampling interval: 1055ms
  Thread calibration: mean lat.: 300.461ms, rate sampling interval: 1201ms
  Thread calibration: mean lat.: 301.445ms, rate sampling interval: 1195ms
  Thread calibration: mean lat.: 308.790ms, rate sampling interval: 1080ms
  Thread calibration: mean lat.: 305.865ms, rate sampling interval: 1199ms
  Thread calibration: mean lat.: 301.120ms, rate sampling interval: 1080ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   316.78ms  186.87ms   1.54s    69.26%
    Req/Sec     9.52      2.89    20.00     83.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  316.16ms
 75.000%  423.68ms
 90.000%  531.97ms
 99.000%  813.05ms
 99.900%    1.32s 
 99.990%    1.54s 
 99.999%    1.54s 
100.000%    1.54s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.482     0.000000            1         1.00
      45.311     0.100000         2903         1.11
     141.695     0.200000         5804         1.25
     222.847     0.300000         8720         1.43
     244.223     0.400000        11608         1.67
     316.159     0.500000        14524         2.00
     326.143     0.550000        15962         2.22
     342.527     0.600000        17405         2.50
     400.895     0.650000        18863         2.86
     411.135     0.700000        20322         3.33
     423.679     0.750000        21757         4.00
     433.151     0.775000        22482         4.44
     491.775     0.800000        23208         5.00
     499.455     0.825000        23962         5.71
     506.879     0.850000        24662         6.67
     517.119     0.875000        25397         8.00
     523.263     0.887500        25748         8.89
     531.967     0.900000        26116        10.00
     553.983     0.912500        26470        11.43
     597.503     0.925000        26855        13.33
     605.183     0.937500        27195        16.00
     611.327     0.943750        27396        17.78
     616.959     0.950000        27570        20.00
     622.591     0.956250        27742        22.86
     632.319     0.962500        27921        26.67
     657.407     0.968750        28103        32.00
     697.343     0.971875        28199        35.56
     705.023     0.975000        28289        40.00
     713.727     0.978125        28374        45.71
     724.991     0.981250        28470        53.33
     733.695     0.984375        28556        64.00
     739.327     0.985938        28602        71.11
     748.031     0.987500        28646        80.00
     795.647     0.989062        28691        91.43
     819.199     0.990625        28739       106.67
     826.879     0.992188        28782       128.00
     831.487     0.992969        28807       142.22
     834.559     0.993750        28827       160.00
     840.703     0.994531        28851       182.86
     848.895     0.995313        28873       213.33
     904.703     0.996094        28895       256.00
     909.823     0.996484        28907       284.44
     913.407     0.996875        28920       320.00
     919.551     0.997266        28929       365.71
     926.207     0.997656        28941       426.67
     946.175     0.998047        28952       512.00
    1101.823     0.998242        28958       568.89
    1126.399     0.998437        28963       640.00
    1196.031     0.998633        28970       731.43
    1233.919     0.998828        28975       853.33
    1316.863     0.999023        28980      1024.00
    1390.591     0.999121        28983      1137.78
    1397.759     0.999219        28986      1280.00
    1399.807     0.999316        28989      1462.86
    1503.231     0.999414        28992      1706.67
    1506.303     0.999512        28994      2048.00
    1512.447     0.999561        28996      2275.56
    1513.471     0.999609        28997      2560.00
    1516.543     0.999658        29000      2925.71
    1516.543     0.999707        29000      3413.33
    1527.807     0.999756        29002      4096.00
    1527.807     0.999780        29002      4551.11
    1530.879     0.999805        29003      5120.00
    1532.927     0.999829        29004      5851.43
    1532.927     0.999854        29004      6826.67
    1535.999     0.999878        29005      8192.00
    1535.999     0.999890        29005      9102.22
    1540.095     0.999902        29006     10240.00
    1540.095     0.999915        29006     11702.86
    1540.095     0.999927        29006     13653.33
    1542.143     0.999939        29007     16384.00
    1542.143     0.999945        29007     18204.44
    1542.143     0.999951        29007     20480.00
    1542.143     0.999957        29007     23405.71
    1542.143     0.999963        29007     27306.67
    1544.191     0.999969        29008     32768.00
    1544.191     1.000000        29008          inf
#[Mean    =      316.776, StdDeviation   =      186.869]
#[Max     =     1543.168, Total count    =        29008]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30049 requests in 5.00m, 168.95MB read
Requests/sec:    100.14
Transfer/sec:    576.57KB