wrk_rps_merged/267
Running 5m test @ http://10.99.61.229:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 605.146ms, rate sampling interval: 2414ms
  Thread calibration: mean lat.: 607.776ms, rate sampling interval: 2056ms
  Thread calibration: mean lat.: 651.592ms, rate sampling interval: 2281ms
  Thread calibration: mean lat.: 627.351ms, rate sampling interval: 2256ms
  Thread calibration: mean lat.: 645.250ms, rate sampling interval: 2248ms
  Thread calibration: mean lat.: 684.162ms, rate sampling interval: 2265ms
  Thread calibration: mean lat.: 631.481ms, rate sampling interval: 2217ms
  Thread calibration: mean lat.: 622.618ms, rate sampling interval: 2211ms
  Thread calibration: mean lat.: 603.120ms, rate sampling interval: 2099ms
  Thread calibration: mean lat.: 637.006ms, rate sampling interval: 2414ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   749.88ms  509.76ms   4.91s    79.04%
    Req/Sec     9.50      2.14    17.00     87.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  697.85ms
 75.000%  901.12ms
 90.000%    1.33s 
 99.000%    2.70s 
 99.900%    3.91s 
 99.990%    4.72s 
 99.999%    4.92s 
100.000%    4.92s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.646     0.000000            1         1.00
     241.279     0.100000         2896         1.11
     417.535     0.200000         5792         1.25
     513.535     0.300000         8688         1.43
     606.207     0.400000        11586         1.67
     697.855     0.500000        14521         2.00
     719.359     0.550000        15928         2.22
     742.399     0.600000        17393         2.50
     803.327     0.650000        18818         2.86
     834.559     0.700000        20273         3.33
     901.119     0.750000        21715         4.00
     921.087     0.775000        22433         4.44
     939.007     0.800000        23156         5.00
    1001.471     0.825000        23884         5.71
    1098.751     0.850000        24631         6.67
    1203.199     0.875000        25340         8.00
    1246.207     0.887500        25689         8.89
    1326.079     0.900000        26059        10.00
    1399.807     0.912500        26432        11.43
    1444.863     0.925000        26778        13.33
    1550.335     0.937500        27140        16.00
    1628.159     0.943750        27318        17.78
    1719.295     0.950000        27500        20.00
    1800.191     0.956250        27681        22.86
    1897.471     0.962500        27860        26.67
    2020.351     0.968750        28041        32.00
    2103.295     0.971875        28133        35.56
    2199.551     0.975000        28224        40.00
    2299.903     0.978125        28317        45.71
    2398.207     0.981250        28405        53.33
    2498.559     0.984375        28501        64.00
    2516.991     0.985938        28538        71.11
    2549.759     0.987500        28585        80.00
    2627.583     0.989062        28630        91.43
    2727.935     0.990625        28675       106.67
    2836.479     0.992188        28720       128.00
    2920.447     0.992969        28742       142.22
    3004.415     0.993750        28765       160.00
    3098.623     0.994531        28790       182.86
    3137.535     0.995313        28811       213.33
    3305.471     0.996094        28833       256.00
    3342.335     0.996484        28845       284.44
    3416.063     0.996875        28855       320.00
    3436.543     0.997266        28868       365.71
    3504.127     0.997656        28878       426.67
    3627.007     0.998047        28889       512.00
    3651.583     0.998242        28895       568.89
    3727.359     0.998437        28900       640.00
    3801.087     0.998633        28906       731.43
    3831.807     0.998828        28912       853.33
    3923.967     0.999023        28917      1024.00
    3934.207     0.999121        28920      1137.78
    3940.351     0.999219        28923      1280.00
    3997.695     0.999316        28926      1462.86
    4130.815     0.999414        28929      1706.67
    4202.495     0.999512        28931      2048.00
    4243.455     0.999561        28933      2275.56
    4300.799     0.999609        28934      2560.00
    4423.679     0.999658        28936      2925.71
    4435.967     0.999707        28937      3413.33
    4456.447     0.999756        28938      4096.00
    4517.887     0.999780        28939      4551.11
    4526.079     0.999805        28940      5120.00
    4530.175     0.999829        28941      5851.43
    4530.175     0.999854        28941      6826.67
    4722.687     0.999878        28942      8192.00
    4722.687     0.999890        28942      9102.22
    4726.783     0.999902        28943     10240.00
    4726.783     0.999915        28943     11702.86
    4726.783     0.999927        28943     13653.33
    4841.471     0.999939        28944     16384.00
    4841.471     0.999945        28944     18204.44
    4841.471     0.999951        28944     20480.00
    4841.471     0.999957        28944     23405.71
    4841.471     0.999963        28944     27306.67
    4915.199     0.999969        28945     32768.00
    4915.199     1.000000        28945          inf
#[Mean    =      749.884, StdDeviation   =      509.762]
#[Max     =     4911.104, Total count    =        28945]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29981 requests in 5.00m, 168.40MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
Requests/sec:     99.92
Transfer/sec:    574.69KB